app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'teacher'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
SELECT COUNT(*) AS `numrows`
FROM `evaluations`
SELECT COUNT(*) AS `numrows`
FROM `evaluation_pdfs`
---
        public function index(): string
    {
        $userModel = new UserModel();
        $evaluationModel = new \App\Models\EvaluationModel();
        $pdfModel = new \App\Models\EvaluationPdfModel();

        $data = [
            'user_name'         => session()->get('user_name'),
            'user_email'        => session()->get('user_email'),
            'total_teachers'    => $userModel->where('role', 'teacher')->countAllResults(),
            'total_students'    => $userModel->where('role', 'student')->countAllResults(),
            'total_evaluations' => $evaluationModel->countAllResults(),
            'total_pdfs'        => $pdfModel->countAllResults(),

SELECT *
FROM `users`
WHERE `role` = 'teacher'
---
    public function teachers(): string
    {
        $model = new UserModel();
        $data  = [
            'teachers' => $model->where('role', 'teacher')->findAll(),
        ];

SELECT *
FROM `users`
WHERE `users`.`id` = 4
---
    public function editTeacher(int $id): string
    {
        $model   = new UserModel();
        $teacher = $model->find($id);

SELECT *
FROM `users`
WHERE `users`.`id` = 4
UPDATE `users` SET `is_active` = 1, `updated_at` = '2026-04-27 12:30:05'
WHERE `users`.`id` IN (4)
---
    public function toggleTeacher(int $id)
    {
        $model   = new UserModel();
        $teacher = $model->find($id);

        if (! $teacher || $teacher['role'] !== 'teacher') {
            return redirect()->to('/admin/teachers')
                             ->with('error', 'Teacher not found.');
        }

        $model->update($id, [
            'is_active' => $teacher['is_active'] ? 0 : 1,
        ]);

SELECT *
FROM `users`
WHERE `role` = 'student'
---
    public function students(): string
    {
        $model = new UserModel();
        $data  = [
            'students' => $model->where('role', 'student')->findAll(),
        ];

INSERT INTO `users` (`name`, `email`, `matricule`, `password`, `role`, `is_active`, `created_at`, `updated_at`) VALUES ('student1', 'student1@gmail.com', 'ET001', '$2y$10$WX17kQbrCJBloLr8.FiubOCkRlaw7LFbdGzRw/kKPaI7DmIVbrDVm', 'student', 1, '2026-05-02 09:30:12', '2026-05-02 09:30:12')
---
    public function storeStudent()
    {
        $rules = [
            'name'       => 'required|min_length[2]|max_length[100]',
            'email'      => 'required|valid_email|is_unique[users.email]',
            'matricule'  => 'required|is_unique[users.matricule]',
            'password'   => 'required|min_length[6]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()
                             ->withInput()
                             ->with('errors', $this->validator->getErrors());
        }

        $model = new UserModel();
        $model->skipValidation(true)->insert([
            'name'      => $this->request->getPost('name'),
            'email'     => $this->request->getPost('email'),
            'matricule' => $this->request->getPost('matricule'),
            'password'  => $this->request->getPost('password'),
            'role'      => 'student',
            'is_active' => 1,
        ]);

SELECT *
FROM `users`
WHERE `users`.`id` = 6
---
    public function editStudent(int $id): string
    {
        $model   = new UserModel();
        $student = $model->find($id);

SELECT *
FROM `courses`
---
    public function courses(): string
    {
        $courseModel = new CourseModel();
        $data = [
            'courses' => $courseModel->findAll(),
        ];

SELECT *
FROM `users`
WHERE `users`.`id` = 4
DELETE FROM `teacher_courses`
WHERE `teacher_id` = 4
INSERT INTO `teacher_courses` (`teacher_id`, `course_id`, `created_at`, `updated_at`) VALUES (4, 2, '2026-04-27 14:43:35', '2026-04-27 14:43:35')
---
    public function saveAssignments(int $teacherId)
    {
        $userModel          = new UserModel();
        $teacherCourseModel = new TeacherCourseModel();

        $teacher = $userModel->find($teacherId);

        if (! $teacher || $teacher['role'] !== 'teacher') {
            return redirect()->to('/admin/teachers')
                             ->with('error', 'Teacher not found.');
        }

        // Delete all existing assignments for this teacher, then re-insert
        $teacherCourseModel->where('teacher_id', $teacherId)->delete();

        $selectedCourses = $this->request->getPost('courses') ?? [];

        foreach ($selectedCourses as $courseId) {
            $teacherCourseModel->insert([
                'teacher_id' => $teacherId,
                'course_id'  => (int) $courseId,
            ]);