app/Controllers/Student.php

SELECT `tc`.`id` as `tc_id`, `u`.`id` as `teacher_id`, `u`.`name` as `teacher_name`, `c`.`id` as `course_id`, `c`.`name` as `course_name`
FROM `teacher_courses` `tc`
JOIN `users` `u` ON `u`.`id` = `tc`.`teacher_id`
JOIN `courses` `c` ON `c`.`id` = `tc`.`course_id`
WHERE `u`.`is_active` = 1
AND `c`.`is_active` = 1
---
    public function evaluate(): string
    {
        $userId = session()->get('user_id');

        $teacherCourseModel = new TeacherCourseModel();
        $evaluationModel = new EvaluationModel();

        // Get all teacher-course combinations (using model's db connection)
        $teacherCourses = $teacherCourseModel->db->table('teacher_courses tc')
                                    ->select('tc.id as tc_id, u.id as teacher_id, u.name as teacher_name, c.id as course_id, c.name as course_name')
                                    ->join('users u', 'u.id = tc.teacher_id')
                                    ->join('courses c', 'c.id = tc.course_id')
                                    ->where('u.is_active', 1)
                                    ->where('c.is_active', 1)
                                    ->get()
                                    ->getResultArray();

SELECT *
FROM `users`
WHERE `users`.`id` = 4
SELECT *
FROM `courses`
WHERE `courses`.`id` = 2
---
    public function evaluateForm(int $teacherId, int $courseId): string
    {
        $userId = session()->get('user_id');

        $evaluationModel = new EvaluationModel();
        $questionModel = new QuestionModel();
        $userModel = new UserModel();
        $courseModel = new CourseModel();

        // Check if already evaluated
        if ($evaluationModel->alreadyEvaluated($userId, $teacherId, $courseId)) {
            return redirect()->to('/student/evaluate')
                             ->with('error', 'You have already evaluated this teacher for this course.');
        }

        $teacher = $userModel->find($teacherId);
        $course = $courseModel->find($courseId);