app/Controllers/Teacher.php

    public function dashboard(): string
    {
        $userId = session()->get('user_id');

        $evaluationModel = new EvaluationModel();
        $pdfModel = new EvaluationPdfModel();
        $courseModel = new CourseModel();
        $teacherCourseModel = new TeacherCourseModel();

        // Get all evaluations for this teacher
        $evaluations = $evaluationModel->getEvaluationsByTeacher($userId);

        // Get all PDFs for this teacher
        $pdfs = $pdfModel->getPdfsByTeacher($userId);

        // Get courses assigned to this teacher (using model's db connection)
        $teacherCourses = $teacherCourseModel->db->table('teacher_courses tc')
                                    ->select('c.id, c.name as course_name')
                                    ->join('courses c', 'c.id = tc.course_id')
                                    ->where('tc.teacher_id', $userId)
                                    ->get()
                                    ->getResultArray();
---
SELECT `c`.`id`, `c`.`name` as `course_name`
FROM `teacher_courses` `tc`
JOIN `courses` `c` ON `c`.`id` = `tc`.`course_id`
WHERE `tc`.`teacher_id` = '4'

    private function calculateAverageScores(int $teacherId): array
    {
        $answerModel = new AnswerModel();

        $answers = $answerModel->db->table('answers a')
                            ->select('q.id as question_id, q.text as question_text, a.score, e.course_id, c.name as course_name')
                            ->join('questions q', 'q.id = a.question_id')
                            ->join('evaluations e', 'e.id = a.evaluation_id')
                            ->join('courses c', 'c.id = e.course_id')
                            ->where('e.teacher_id', $teacherId)
                            ->where('a.score IS NOT NULL')
                            ->get()
                            ->getResultArray();
---
SELECT `q`.`id` as `question_id`, `q`.`text` as `question_text`, `a`.`score`, `e`.`course_id`, `c`.`name` as `course_name`
FROM `answers` `a`
JOIN `questions` `q` ON `q`.`id` = `a`.`question_id`
JOIN `evaluations` `e` ON `e`.`id` = `a`.`evaluation_id`
JOIN `courses` `c` ON `c`.`id` = `e`.`course_id`
WHERE `e`.`teacher_id` = 4
AND `a`.`score` IS NOT NULL