app/Models/EvaluationModel.php

    public function getEvaluationsByStudent(int $studentId): array
    {
        return $this->db->table('evaluations e')
                        ->select('e.id, e.status, e.created_at, u.name as teacher_name, c.name as course_name')
                        ->join('users u', 'u.id = e.teacher_id')
                        ->join('courses c', 'c.id = e.course_id')
                        ->where('e.student_id', $studentId)
                        ->orderBy('e.created_at', 'DESC')
                        ->get()
                        ->getResultArray();
---
SELECT `e`.`id`, `e`.`status`, `e`.`created_at`, `u`.`name` as `teacher_name`, `c`.`name` as `course_name`
FROM `evaluations` `e`
JOIN `users` `u` ON `u`.`id` = `e`.`teacher_id`
JOIN `courses` `c` ON `c`.`id` = `e`.`course_id`
WHERE `e`.`student_id` = 6
ORDER BY `e`.`created_at` DESC

    public function getEvaluationsByTeacher(int $teacherId): array
    {
        return $this->db->table('evaluations e')
                        ->select('e.id, e.status, e.created_at, u.name as student_name, c.name as course_name')
                        ->join('users u', 'u.id = e.student_id')
                        ->join('courses c', 'c.id = e.course_id')
                        ->where('e.teacher_id', $teacherId)
                        ->orderBy('e.created_at', 'DESC')
                        ->get()
                        ->getResultArray();
---
SELECT `e`.`id`, `e`.`status`, `e`.`created_at`, `u`.`name` as `student_name`, `c`.`name` as `course_name`
FROM `evaluations` `e`
JOIN `users` `u` ON `u`.`id` = `e`.`student_id`
JOIN `courses` `c` ON `c`.`id` = `e`.`course_id`
WHERE `e`.`teacher_id` = 4
ORDER BY `e`.`created_at` DESC

    public function alreadyEvaluated(int $studentId, int $teacherId, int $courseId): bool
    {
        return $this->where('student_id', $studentId)
                    ->where('teacher_id', $teacherId)
                    ->where('course_id', $courseId)
                    ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `evaluations`
WHERE `student_id` = 6
AND `teacher_id` = 4
AND `course_id` = 2