app/Models/EvaluationPdfModel.php

    public function getPdfsByTeacher(int $teacherId): array
    {
        return $this->db->table('evaluation_pdfs p')
                        ->select('p.id, p.file_path, p.generated_at, e.id as evaluation_id, e.status,
                                  s.name as student_name, c.name as course_name')
                        ->join('evaluations e', 'e.id = p.evaluation_id')
                        ->join('users s', 's.id = e.student_id')
                        ->join('courses c', 'c.id = e.course_id')
                        ->where('e.teacher_id', $teacherId)
                        ->orderBy('p.generated_at', 'DESC')
                        ->get()
                        ->getResultArray();
---
SELECT `p`.`id`, `p`.`file_path`, `p`.`generated_at`, `e`.`id` as `evaluation_id`, `e`.`status`, `s`.`name` as `student_name`, `c`.`name` as `course_name`
FROM `evaluation_pdfs` `p`
JOIN `evaluations` `e` ON `e`.`id` = `p`.`evaluation_id`
JOIN `users` `s` ON `s`.`id` = `e`.`student_id`
JOIN `courses` `c` ON `c`.`id` = `e`.`course_id`
WHERE `e`.`teacher_id` = 4
ORDER BY `p`.`generated_at` DESC