app/Models/QuestionModel.php

SELECT `q`.`id`, `q`.`text`, `q`.`type`, `q`.`is_active`, `c`.`name` as `category_name`
FROM `questions` `q`
LEFT JOIN `categories` `c` ON `c`.`id` = `q`.`category_id`
WHERE `q`.`is_active` = 1
ORDER BY `c`.`name` ASC, `q`.`id` ASC
---
    public function getActiveWithCategory(): array
    {
        return $this->db->table('questions q')
                        ->select('q.id, q.text, q.type, q.is_active, c.name as category_name')
                        ->join('categories c', 'c.id = q.category_id', 'left')
                        ->where('q.is_active', 1)
                        ->orderBy('c.name', 'ASC')
                        ->orderBy('q.id', 'ASC')
                        ->get()
                        ->getResultArray();