app/Models/UserModel.php

    public function findByEmail(string $email): array|null
    {
        return $this->where('email', $email)
                    ->where('is_active', 1)
                    ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'ETU001'
AND `is_active` = 1
 LIMIT 1

    public function findByMatricule(string $matricule): array|null
    {
        return $this->where('matricule', $matricule)
                    ->where('role', 'student')
                    ->where('is_active', 1)
                    ->first();
---
SELECT *
FROM `users`
WHERE `matricule` = 'ETU001'
AND `role` = 'student'
AND `is_active` = 1
 LIMIT 1